Repository: mmnete/dukani
Catalog: mobile_app_flutter/lib/l10n/app_*.arb
Languages: sw

# welcomeMessage
source: Welcome, {managerName}
sw: Karibu, {managerName}

source: Dashboard Overview
sw: Muhtasari wa Biashara

source: Quick Stock Overview
sw: Muhtasari wa Bidhaa Zako

source: Stock In
sw: Bidhaa Zilizoingia

# stockOut
source: Sales
sw: Mauzo

source: Missed Sales
sw: Mauzo Yaliyokosekana

source: Weekly Stock Movement Analytics
sw: Uchambuzi wa Harakati za Bidhaa

source: Quick Actions
sw: Kazi za Haraka

source: Record Sales
sw: Rekodi Mauzo

source: Record Stock In
sw: Ingiza Bidhaa

source: View Inventory
sw: Angalia Bidhaa

source: Sales Report
sw: Ripoti ya Mauzo

source: Manage Products
sw: Bidhaa Zako

source: Manage Workers
sw: Wafanyakazi

source: Manager Menu
sw: Menyu ya Meneja

source: Profile Settings
sw: Mipangilio ya Wasifu

source: Logout
sw: Toka

# navigatingTo
source: Navigating to {screenName}...
sw: Inakwenda kwenye {screenName}...

source: (Not implemented yet)
sw: (Bado haijatekelezwa)

# monday
source: Mon
sw: Jtatu

# tuesday
source: Tue
sw: Jnnne

# wednesday
source: Wed
sw: Jtano

# thursday
source: Thu
sw: Alhms

# friday
source: Fri
sw: Ijumaa

# saturday
source: Sat
sw: Jmosi

# sunday
source: Sun
sw: Jpili

source: Invite Worker
sw: Alika Mfanyakazi

source: Enter phone number
sw: Weka namba ya simu

source: Select from Contacts
sw: Chagua kutoka kwa Anwani

source: Send Invite
sw: Tuma Mwaliko

# contactPermissionDenied
source: Contact permission denied. Please enable it in settings to select contacts.
sw: Ruhusa ya anwani imekataliwa. Tafadhali iwashe kwenye mipangilio ili kuchagua anwani.

source: No phone number selected.
sw: Hakuna namba ya simu iliyochaguliwa.

# inviteSentSuccessfully
source: Invite sent successfully to {phoneNumber}!
sw: Mwaliko umetuma kwa {phoneNumber}!

# inviteFailed
source: Failed to send invite to {phoneNumber}.
sw: Imeshindwa kutuma mwaliko kwa {phoneNumber}.

# invalidPhoneNumber
source: Please enter a valid phone number.
sw: Tafadhali weka namba ya simu halali.

# phoneNumberAlreadyAdded
source: This phone number is already added.
sw: Namba hii ya simu tayari imeongezwa.

source: Add Phone Number
sw: Ongeza Namba ya Simu

source: Selected Contacts
sw: Anwani Zilizochaguliwa

source: Register Your Shop
sw: Sajili Duka Lako

source: Shop Name
sw: Jina la Duka

source: Shop Address
sw: Anwani ya Duka

source: Complete Shop Registration
sw: Kamilisha Usajili wa Duka

source: Register Manager
sw: Sajili Meneja

source: Manager Name
sw: Jina la Meneja

source: Manager Phone
sw: Namba ya Simu ya Meneja

source: Complete Manager Registration
sw: Kamilisha Usajili wa Meneja

source: Worker Management Center
sw: Usimamizi wa Wafanyakazi

source: Search Workers
sw: Tafuta Wafanyakazi

source: Worker Activity Log
sw: Shughuli za Mfanyakazi

# noActivityRecorded
source: No activity recorded for this worker.
sw: Hakuna shughuli iliyorekodiwa kwa mfanyakazi huyu.

# noWorkersFound
source: You have no workers yet.
sw: Hakuna wafanyakazi kwenye mfumo wako.

source: Worker Removed!
sw: Mfanyakazi katolewa!

# workerProfile
source: Profile
sw: Taarifa

source: Actions Today
sw: Kinachoendelea

source: Last Activity
sw: Kazi ya hivi karibuni
